convertigo-templates/lib_Salesforce/soap-templates/SoapBinding/Cquery.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:partner.soap.sforce.com">
   <soapenv:Header>
      <urn:PackageVersionHeader>
         <!--Zero or more repetitions:-->
         <urn:packageVersions>
            <!--type: {http://www.w3.org/2001/XMLSchema}int-->
            <urn:majorNumber>$(HEADER_PACKAGEVERSIONHEADER_PACKAGEVERSIONS_MAJORNUMBER)</urn:majorNumber>
            <!--type: {http://www.w3.org/2001/XMLSchema}int-->
            <urn:minorNumber>$(HEADER_PACKAGEVERSIONHEADER_PACKAGEVERSIONS_MINORNUMBER)</urn:minorNumber>
            <!--type: {http://www.w3.org/2001/XMLSchema}string-->
            <urn:namespace>$(HEADER_PACKAGEVERSIONHEADER_PACKAGEVERSIONS_NAMESPACE)</urn:namespace>
         </urn:packageVersions>
      </urn:PackageVersionHeader>
      <urn:MruHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:updateMru>$(HEADER_MRUHEADER_UPDATEMRU)</urn:updateMru>
      </urn:MruHeader>
      <urn:QueryOptions>
         <!--Optional:-->
         <!--type: {http://www.w3.org/2001/XMLSchema}int-->
         <urn:batchSize>$(HEADER_QUERYOPTIONS_BATCHSIZE)</urn:batchSize>
      </urn:QueryOptions>
      <urn:CallOptions>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:client>$(HEADER_CALLOPTIONS_CLIENT)</urn:client>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:defaultNamespace>$(HEADER_CALLOPTIONS_DEFAULTNAMESPACE)</urn:defaultNamespace>
      </urn:CallOptions>
      <urn:SessionHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:sessionId>$(HEADER_SESSIONHEADER_SESSIONID)</urn:sessionId>
      </urn:SessionHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:query>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:queryString>$(BODY_QUERY_QUERYSTRING)</urn:queryString>
      </urn:query>
   </soapenv:Body>
</soapenv:Envelope>